<!DOCTYPE html>
<html lang="en-US">
	<head>
		<meta charset="utf-8">
	</head>
	<body>
		<h2>{{ $username }}</h2>

		<div>
			<p>如果您没有提交密码重置的请求或不是 {{ Config()->get('common.app_name') }} 的注册用户，请立即忽略并删除这封邮件。只有在您确认需要重置密码的情况下，才需要继续阅读下面的内容。</p>

			<p>----------------------------------------------------------------------
			<br>
			<strong>密码重置说明</strong>
			<br>
			----------------------------------------------------------------------</p>

			<p>您需在提交请求后的{{ Config()->get('common.expire') }}小时内，通过点击下面的链接重置您的密码：<br>
			 <a href="{{ $url }}">点我重置密码</a><br>
			(如果上面不是链接形式，请将该地址手工粘贴到浏览器地址栏再访问)<br>
			在上面链接打开的页面中输入新密码后提交，您即可使用新的密码登录了。您也可以在用户控制面板中随时修改您的密码。
			</p>

			<p>此致<br>
			{{ Config()->get('common.app_name') }} 管理团队.</p>
		</div>
	</body>
</html>